BOT_TOKEN = "HERE YOU CAN PASTE API KEY FOR YOUR BOT"

ADMIN_USERS = ["k6zma", "maletskayaaa"]

STUDENTS_NAME_AND_TG_DICT = {
    "bbar13": "Андреев Роман Вячеславович",
    "nekkkkate": "Бочагова Екатерина Алексеевна",
    "apurpleas": "Васенков Александр Владимирович",
    "sugarvanya": "Галкин Иван Юрьевич",
    "k6zma": "Гунин Михаил Александрович",
    "sa_dashk": "Дашкевич Александр Анатольевич",
    "mamooin": "Карелин Роман Александрович",
    "TTAJIbMA": "Колганов Артём Михайлович",
    "rian_ranlee": "Кононенко Кирилл Дмитриевич",
    "mariiakrasivina": "Красивина Мария Олеговна",
    "riktah": "Крючкова Елизавета Сергеевна",
    "m4lvx": "Кургут Михаил Александрович",
    "zzz20thcenturyboyzzz": "Кушнир Никита Алексеевич",
    "claucdan": "Лукин Даниил Валерьевич",
    "maletskayaaa": "Малецкая Мария Александровна",
    "taisssam": "Минакова Таисия Алексееевна",
    "fgiklfj": "Минская Анастасия Вадимовна",
    "Antoozq": "Нестеров Глеб Дмитриевич",
    "Apikeris": "Савин Максим Дмитриевич",
    "acquiant": "Сандалов Егор Родионович",
    "slavakrez": "Тимофеев Вячеслва Александрович",
    "mirusia8": "Тинякова Мирослава Дмитриевна",
    "blacktearemos": "Токарский Данила Максимович",
    "Ptaha1766": "Угрюмов Павел Дмитриевич",
}

STUDENT_NAME_LIST = [
    "Андреев Роман Вячеславович",
    "Бочагова Екатерина Алексеевна",
    "Васенков Александр Владимирович",
    "Галкин Иван Юрьевич",
    "Гунин Михаил Александрович",
    "Дашкевич Александр Анатольевич",
    "Карелин Роман Александрович",
    "Колганов Артём Михайлович",
    "Кононенко Кирилл Дмитриевич",
    "Красивина Мария Олеговна",
    "Крючкова Елизавета Сергеевна",
    "Кургут Михаил Александрович",
    "Кушнир Никита Алексеевич",
    "Лукин Даниил Валерьевич",
    "Малецкая Мария Александровна",
    "Минакова Таисия Алексееевна",
    "Минская Анастасия Вадимовна",
    "Нестеров Глеб Дмитриевич",
    "Савин Максим Дмитриевич",
    "Сандалов Егор Родионович",
    "Тимофеев Вячеслва Александрович",
    "Тинякова Мирослава Дмитриевна",
    "Токарский Данила Максимович",
    "Угрюмов Павел Дмитриевич",
]

LABS_COUNT = {"OP": 8, "EVM": 10}

DB_PATH = "students.db"
